app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "zip_code", "phone", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "risheak"], ["zip_code", "93003"], ["phone", "1234567890"], ["email", "abc@getmainstreet.com"]]

  def update
    if @company.update(company_params)
---
UPDATE "companies" SET "name" = $1, "zip_code" = $2, "email" = $3, "city" = $4, "state" = $5 WHERE "companies"."id" = $6  [["name", "Updated Test Company"], ["zip_code", "93009"], ["email", "updated_email@getmainstreet.com"], ["city", "Ventura"], ["state", "California/CA"], ["id", 187955600]]

  def destroy
    if @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 187955600]]